locations/app/controllers/locations_controller.rb

SELECT "locations".* FROM "locations"
---
  def index
    render json: Location.all