locations/app/controllers/sellers_controller.rb

    def index
      render json: Seller.all
---
SELECT "sellers".* FROM "sellers"